---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Document..::..GetRoomAtPoint Method
Document Class See Also Send Feedback
---

Gets a room containing the point.

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetRoomAtPoint(XYZ) | Gets a room containing the point. |
|  | GetRoomAtPoint(XYZ, Phase) | Gets a room containing the point. |

# See Also

Document Class

Document Members

Autodesk.Revit.DB Namespace